# Introduction to SQL and Advanced Functions

# Question 1: Explain the fundamental differences between DDL, DML, and DQL commands in SQL. Provide one example for each type of command.


Here’s a clear and simple explanation of **DDL**, **DML**, and **DQL** in SQL, along with examples.



## **1. DDL – Data Definition Language**

**Purpose:** Defines and manages the structure of database objects such as tables, schemas, indexes, etc.

**Key Actions:** Create, alter, delete database structures.

**Typical Commands:**

* `CREATE`
* `ALTER`
* `DROP`
* `TRUNCATE`

**Example (DDL):**

```sql
CREATE TABLE students (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    age INT
);
```

This creates the structure of a table.



## **2. DML – Data Manipulation Language**

**Purpose:** Inserts, updates, deletes, and manages data inside tables.

**Key Actions:** Work with **data**, not structure.

**Typical Commands:**

* `INSERT`
* `UPDATE`
* `DELETE`
* `MERGE`

**Example (DML):**

```sql
INSERT INTO students (id, name, age)
VALUES (1, 'Rahul', 20);
```





## **3. DQL – Data Query Language**

**Purpose:** Retrieves data from database tables.

**Key Actions:** Query/fetch data.

**Typical Command:**

* `SELECT` (the primary DQL command)

**Example (DQL):**

```sql
SELECT name, age
FROM students
WHERE age > 18;
```



###  Summary Table

| Type | Full Form                  | Purpose           | Works On           | Examples               |
| ---- | -------------------------- | ----------------- | ------------------ | ---------------------- |
| DDL  | Data Definition Language   | Defines structure | Tables, schemas    | CREATE, ALTER          |
| DML  | Data Manipulation Language | Modifies data     | Rows inside tables | INSERT, UPDATE, DELETE |
| DQL  | Data Query Language        | Reads data        | Tables             | SELECT                 |

# Question 2 : What is the purpose of SQL constraints? Name and describe three common types of constraints, providing a simple scenario where each would be useful.


SQL constraints are rules applied to table columns to ensure data accuracy, consistency, and reliability. They prevent invalid data from being inserted into the database.



 Three Common SQL Constraints (with examples & scenarios)


 **1. PRIMARY KEY Constraint**

Ensures each row in a table has a **unique** and **non-null** identifier.

When creating a **students** table, each student must have a unique roll number or ID.

 **Example:**

```sql
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    name VARCHAR(50)
);
```

 **2. FOREIGN KEY Constraint**

Maintains referential integrity between two tables by ensuring a value exists in the referenced (parent) table.

A orders table must refer to valid customers. You cannot place an order for a non-existing customer.

**Example:**

```sql
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);
```

**3. UNIQUE Constraint**

Ensures all values in a column are unique (no duplicates).

A users table should not allow two users with the same email ID.

### **Example:**

```sql
CREATE TABLE users (
    user_id INT PRIMARY KEY,
    email VARCHAR(100) UNIQUE
);
```


 Summary Table

| Constraint      | Ensures                                   | Example Scenario                 |
| --------------- | ----------------------------------------- | -------------------------------- |
| **PRIMARY KEY** | Unique + NOT NULL identifier              | Student ID, Employee ID          |
| **FOREIGN KEY** | Parent-child table relationship integrity | Orders linked to valid customers |
| **UNIQUE**      | No duplicate values                       | Email ID should be unique        |

# Question 3 : Explain the difference between LIMIT and OFFSET clauses in SQL. How would you use them together to retrieve the third page of results, assuming each page has 10 records?


 **Difference Between LIMIT and OFFSET**

LIMIT

* Specifies how many rows to return.
* Controls the maximum number of records in the result.

Example:

```sql
SELECT * FROM products
LIMIT 10;
```

→ Returns first 10 rows.

 OFFSET

* Specifies how many rows to skip before starting to return results.
* Works together with LIMIT for pagination.

Example:

```sql
SELECT * FROM products
LIMIT 10 OFFSET 20;
```

→ Skips first 20 rows, returns next 10.



 **Retrieve the 3rd Page of Results (10 Records per Page)**

To get page 3:
Final Query:

```sql
SELECT *
FROM table
LIMIT 10
OFFSET 20;
```

This retrieves the **3rd page**, containing records **21 to 30**.

# Question 4 : What is a Common Table Expression (CTE) in SQL, and what are its main benefits? Provide a simple SQL example demonstrating its usage.


A Common Table Expression (CTE) in SQL is a temporary, named result set defined using the WITH keyword.
It exists only for the duration of the query and helps make SQL code more readable and modular.


**What is a CTE?

A CTE is like creating a **temporary table** or **subquery** that you can refer to again within a main query.

Main Benefits of CTEs:

* **Readability**
* **Maintainability**
* **Reusability** (you can reference it multiple times)
* **Complex query organization**





**Simple CTE Example**

 Get employees with salary > 50000:

```sql
WITH high_salary AS (
    SELECT emp_id, name, salary
    FROM employees
    WHERE salary > 50000
)
SELECT *
FROM high_salary;
```

# Question 5 : Describe the concept of SQL Normalization and its primary goals. Briefly explain the first three normal forms (1NF, 2NF, 3NF).


**Normalization** is the process of organizing data in a database to **reduce redundancy** (duplicate data) and **improve data integrity**.
It ensures data is stored logically and efficiently.

 **First Three Normal Forms (1NF, 2NF, 3NF)**

**1NF — First Normal Form**

* All values are atomic (no multiple values in one cell)
* No repeating groups or arrays
* Each record is unique

 **2NF — Second Normal Form**

* It is already in 1NF
* All non-key columns fully depend on the primary key
* No partial dependency (applies when primary key is composite)

**3NF — Third Normal Form**

* It is in **2NF**
* No transitive dependency (non-key column depending on another non-key column)


# Summary Table

| Normal Form | Condition                             | Goal                        |
| ----------- | ------------------------------------- | --------------------------- |
| **1NF**     | Atomic values, no repeating groups    | Remove repeating data       |
| **2NF**     | No partial dependency (composite key) | Ensure full key dependency  |
| **3NF**     | No transitive dependency              | Avoid indirect dependencies |

# Question 6, 7, 8, 9

USE ECommerceDB;


INSERT INTO Categories (CategoryID, CategoryName) VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');



INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES


(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel: The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);



INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');



INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);


SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberOfOrders
FROM Customers c
LEFT JOIN Orders o
    ON c.CustomerID = o.CustomerID
GROUP BY
    c.CustomerID, c.CustomerName, c.Email
ORDER BY
    c.CustomerName;
    

    
    
    SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM Products p
INNER JOIN Categories c
    ON p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName,
    p.ProductName;

    

WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (
            PARTITION BY c.CategoryName
            ORDER BY p.Price DESC
        ) AS PriceRank
    FROM Products p
    INNER JOIN Categories c
        ON p.CategoryID = c.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM RankedProducts
WHERE PriceRank <= 2
ORDER BY CategoryName, Price DESC;